## KPMG Virtual Internship (Module 1 Task - CustomerAddress)

### Author: Ashley Ooi

In [1]:
# Importing the necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Importing the xlsx file provided 
# pandas is used to read the file 'CustomerAddress.xlsx'
df = pd.read_excel('CustomerAddress.xlsx')
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [3]:
# Understanding the data
# Checking the number of rows and columns
df.shape

(3999, 6)

In [4]:
# checking the data types
df.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [5]:
# checking the total number of NA for each of the columns
df.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [6]:
# checking the unique values for the column 'state'
df['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [7]:
# checking the unique values for the column 'country'
df['country'].unique()

array(['Australia'], dtype=object)

In [8]:
# replacing values to achieve uniformity of data 
df['state'].replace({"NSW": "New South Wales", "VIC": "Victoria", "QLD": "Queensland"}, inplace=True)

In [9]:
# showing the unique values for the column 'state' to make sure changes are made
df['state'].unique()

array(['New South Wales', 'Queensland', 'Victoria'], dtype=object)

In [10]:
# setting the index to the column 'customer_id'
df = df.set_index('customer_id')

In [11]:
# displaying the first 5 rows of the dataset
df.head()

,address,postcode,state,country,property_valuation
customer_id,,,,,
1,060 Morning Avenue,2016,New South Wales,Australia,10
2,6 Meadow Vale Court,2153,New South Wales,Australia,10
4,0 Holy Cross Court,4211,Queensland,Australia,9
5,17979 Del Mar Point,2448,New South Wales,Australia,4
6,9 Oakridge Court,3216,Victoria,Australia,9

In [12]:
df.to_excel("output.xlsx")